### Pandas

In [13]:
import pandas as pd 
import numpy as np

In [4]:
data = {'Name':['anshika','sania','lakshya','akshay'],
        'city':['kota','hyderabad','jaipur','delhi'],
        'branch':['cse','it','it','civil'],
        'roll_no':[10,20,30,40]}
data

{'Name': ['anshika', 'sania', 'lakshya', 'akshay'],
 'city': ['kota', 'hyderabad', 'jaipur', 'delhi'],
 'branch': ['cse', 'it', 'it', 'civil'],
 'roll_no': [10, 20, 30, 40]}

In [5]:
df = pd.DataFrame(data)
df

      Name       city branch  roll_no
0  anshika       kota    cse       10
1    sania  hyderabad     it       20
2  lakshya     jaipur     it       30
3   akshay      delhi  civil       40

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [10]:
df['Name']

0    anshika
1      sania
2    lakshya
3     akshay
Name: Name, dtype: object

In [9]:
type(df['Name'])

pandas.core.series.Series

In [12]:
df.Name   # series

0    anshika
1      sania
2    lakshya
3     akshay
Name: Name, dtype: object

In [14]:
arr = np.random.randint(1,200,50)
arr

array([188,  81,   9,  88,  29,  22, 151, 151,  48,  60, 134,  94,  84,
       130,  90,  78, 193,  12,  70,  12, 139,  56,  51, 139,  26,  98,
        81,  95,   6, 105, 198, 183, 149, 125,   1, 126, 121, 147, 154,
       185, 138, 103, 174,  98, 123, 117, 196, 172, 195,  49], dtype=int32)

In [19]:
ser = pd.Series(arr,name='random_numbers',dtype='f')
ser

0     188.0
1      81.0
2       9.0
3      88.0
4      29.0
5      22.0
6     151.0
7     151.0
8      48.0
9      60.0
10    134.0
11     94.0
12     84.0
13    130.0
14     90.0
15     78.0
16    193.0
17     12.0
18     70.0
19     12.0
20    139.0
21     56.0
22     51.0
23    139.0
24     26.0
25     98.0
26     81.0
27     95.0
28      6.0
29    105.0
30    198.0
31    183.0
32    149.0
33    125.0
34      1.0
35    126.0
36    121.0
37    147.0
38    154.0
39    185.0
40    138.0
41    103.0
42    174.0
43     98.0
44    123.0
45    117.0
46    196.0
47    172.0
48    195.0
49     49.0
Name: random_numbers, dtype: float32

In [23]:
ser[ser < 50]

2      9.0
4     29.0
5     22.0
8     48.0
17    12.0
19    12.0
24    26.0
28     6.0
34     1.0
49    49.0
Name: random_numbers, dtype: float32

In [28]:
ser[0] # single item

np.float32(188.0)

In [29]:
ser[0:3]  # same rule

0    188.0
1     81.0
2      9.0
Name: random_numbers, dtype: float32

In [33]:
ser.min()

np.float32(1.0)

In [34]:
ser.max()

np.float32(198.0)

In [35]:
ser.mean()

np.float32(105.48)

In [36]:
ser.median()  # <===

np.float32(104.0)

In [37]:
ser.var()

np.float32(3312.2139)

In [38]:
ser.std()

np.float32(57.551838)

In [45]:
ser.sum()

np.float32(5274.0)

In [51]:
ser.agg(['min','max','mean','median','var','std','sum'])

min          1.000000
max        198.000000
mean       105.480003
median     104.000000
var       3312.213867
std         57.551838
sum       5274.000000
Name: random_numbers, dtype: float32

In [53]:
df.shape

(4, 4)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   city     4 non-null      object
 2   branch   4 non-null      object
 3   roll_no  4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [58]:
df["Name"]  # series 1D

0    anshika
1      sania
2    lakshya
3     akshay
Name: Name, dtype: object

In [59]:
df[["Name"]]  # dataframe 2D

      Name
0  anshika
1    sania
2  lakshya
3   akshay

In [60]:
type(df[["Name"]])

pandas.core.frame.DataFrame

In [61]:
type(df["Name"])

pandas.core.series.Series

In [64]:
df[['Name','city']]

      Name       city
0  anshika       kota
1    sania  hyderabad
2  lakshya     jaipur
3   akshay      delhi

In [66]:
df[['branch','Name']]  # to access multiple columns from a dataframe

  branch     Name
0    cse  anshika
1     it    sania
2     it  lakshya
3  civil   akshay

#### loc and iloc

In [71]:
df.loc[0]  # single row

Name       anshika
city          kota
branch         cse
roll_no         10
Name: 0, dtype: object

In [73]:
df.loc[1]

Name           sania
city       hyderabad
branch            it
roll_no           20
Name: 1, dtype: object

In [79]:
df.loc[0:2]

      Name       city branch  roll_no
0  anshika       kota    cse       10
1    sania  hyderabad     it       20
2  lakshya     jaipur     it       30

In [81]:
df.iloc[0:2,1:3]

        city branch
0       kota    cse
1  hyderabad     it